In [16]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

Pandas

In [17]:
import numpy as np
import pandas as pd

In [3]:
#Series

NameError: name 'Series' is not defined

In [18]:
list_1 = ['a','b','c','d']
labels = [1,2,3,4]
ser_1 = pd.Series(data=list_1, index=labels)
ser_1.dtype

arr_1 = np.array([1,2,3,4])
ser_2 = pd.Series(arr_1)
ser_2

dict_1 = {'f_name': 'Kathryne', 'l_name': 'Zong', 'age': 15}
ser_3 = pd.Series(dict_1, name='person')
ser_3.name

dtype('O')

0    1
1    2
2    3
3    4
dtype: int64

'person'

In [6]:
#DataFrames

NameError: name 'DataFrames' is not defined

In [7]:
#Creating DataFrames

SyntaxError: invalid syntax (<ipython-input-7-493d345affd6>, line 1)

In [29]:
arr_2 = np.random.randint(1,10, size=(2,3))
arr_2

df_1 = pd.DataFrame(arr_2,['A', 'B'], ['C', 'D', 'E'])
print(df_1.shape) #tells rows then columns

dict_3 = {'one': pd.Series([1., 2., 3.], index=['a','b','c']),
        'two': pd.Series([1., 2., 3., 4.], index=['a','b','c','d'])}
df_2 = pd.DataFrame(dict_3)
df_2

pd.DataFrame.from_dict(dict([('A', [1,2,3]),('B', [4,5,6])]))
pd.DataFrame.from_dict(dict([('A', [1,2,3]),('B', [4,5,6])]), 
                       orient='index', columns=['one', 'two', 'three'])

array([[9, 1, 6],
       [4, 8, 5]])

(2, 3)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

   A  B
0  1  4
1  2  5
2  3  6

   one  two  three
A    1    2      3
B    4    5      6

In [10]:
Editing and Retrieving Data

SyntaxError: invalid syntax (<ipython-input-10-0099a5b2b121>, line 1)

In [30]:
#multiply 2 columns
print(df_2)
df_2['mult'] = df_2['one'] * df_2['two']

#add a column by adding 2 rows
print(df_1)
df_1[['C', 'E']]
df_1.loc['A']
df_1['Total'] = df_1['C']+df_1['D']+df_1['E']
df_1

#append new row
dict_2 = {'C': 44, 'D': 45, 'E': 46}
new_row = pd.Series(dict_2, name = 'F')
df_1 = df_1.append(new_row)
df_1

#delete a column
df_1.drop('Total', axis=1, inplace=True)
df_1

#delete a column
df_1.drop('A', axis=0, inplace=True)
df_1

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
   C  D  E
A  9  1  6
B  4  8  5

   C  E
A  9  6
B  4  5

C    9
D    1
E    6
Name: A, dtype: int64

   C  D  E  Total
A  9  1  6     16
B  4  8  5     17

      C     D     E  Total
A   9.0   1.0   6.0   16.0
B   4.0   8.0   5.0   17.0
F  44.0  45.0  46.0    NaN

      C     D     E
A   9.0   1.0   6.0
B   4.0   8.0   5.0
F  44.0  45.0  46.0

      C     D     E
B   4.0   8.0   5.0
F  44.0  45.0  46.0

In [ ]:
#STOPPED VIDEO AT15:00